[
    {
        "text": "The government has passed a law ensuring social, economic, and political justice for all citizens.",
        "relatedArticle": "Justice – social, economic, and political",
        "decision": "uphold"
   },
    {
        "text": "The government has passed a law mandating equal employment opportunities for all citizens.",
        "relatedArticle": "Equality of opportunity",
        "decision": "uphold"
    },
    {
        "text": "The government has passed a law ensuring free and fair elections.",
        "relatedArticle": "Democratic Republic.",
        "decision": "uphold"
    },
    {
        "text": "The government has passed a law ensuring the freedom to form political associations.",
        "relatedArticle": "Liberty of thought, expression, belief, faith, and worship.",
        "decision": "uphold"
    },
    {
        "text": "The government has passed a law declaring that citizens of a specific region must carry identity cards.",
        "relatedArticle": "Fraternity, assuring dignity of the individual.",
        "decision": "strike"
    },
    {
        "text": "The government has passed a law restricting the freedom to assemble in public spaces.",
        "relatedArticle": "Article 19: Freedom of speech and expression; Right to assemble peacefully without arms.",
        "decision": "strike"
    },
    {
        "text":"The government has passed a law that allows religious groups to manage their educational institutions",
        "relatedArticle":"Article 30: Rights of minorities to establish and administer educational institutions.",
        "decision":"uphold"
    },
    {
        "text":"The government has passed a law seizing property without compensation.",
        "relatedArticle":"Article 300A: Right to property (though no longer a fundamental right, it’s still protected)",
        "decision":"strike"
    },
    {
        "text":"The government has passed a law banning media from criticizing the government.",
        "relatedArticle":"Article 19(1)(a): Freedom of speech and expression.",
        "decision":"strike"
    },
    {
        "text":"The government has passed a law providing reservation to economically weaker sections.",
        "relatedArticle":"Article 15: Prohibition of discrimination on grounds of religion, race, caste, sex, or place of birth.",
        "decision":"uphold"
    },
    {
        "text":"The government has passed a law ensuring maternity leave for women in both public and private sectors.",
        "relatedArticle":"Article 42: Provision for just and humane conditions of work and maternity relief.",
        "decision":"uphold"
    },
    {
        "text":"The government has passed a law banning child labor in hazardous industries.",
        "relatedArticle":"Article 39(e): The State shall direct its policy towards securing that children are not forced by economic necessity to enter vocations unsuited to their age.",
        "decision":"uphold"
    },{
        "text":"The government has passed a law promoting village panchayats for local governance.",
        "relatedArticle":"Article 40: Organization of village panchayats.",
        "decision":"uphold"
    },{
        "text":"The government has passed a law mandating free legal aid for the poor.",
        "relatedArticle":"Article 39A: Equal justice and free legal aid.",
        "decision":"uphold"
    },
    {
        "text":"The government has passed a law implementing minimum wages for all workers.",
        "relatedArticle":"Article 43: Living wage, etc., for workers.",
        "decision":"uphold"
    },
    {
        "text":"The government has passed a law mandating citizens to plant trees on public holidays.",
        "relatedArticle":"Article 51A(g): To protect and improve the natural environment.",
        "decision":"uphold"
    },{
        "text":"The government has passed a law encouraging citizens to adopt scientific temper and promote education.",
        "relatedArticle":"Article 51A(h): To develop scientific temper, humanism, and the spirit of inquiry and reform.",
        "decision":"uphold"
    },{
        "text":"The government has passed a law making it mandatory to respect the National Flag and National Anthem.",
        "relatedArticle":"Article 51A(a): To abide by the Constitution and respect its ideals and institutions, the National Flag, and the National Anthem.",
        "decision":"uphold"
    },{
        "text":"The government has passed a law imposing severe fines on citizens who neglect their parents.",
        "relatedArticle":"Article 51A(e): To promote harmony and the spirit of common brotherhood among all the people of India.",
        "decision":"uphold"
    },{
        "text":"The government has passed a law to prevent destruction of public property during protests.",
        "relatedArticle":"Article 51A(i): To safeguard public property and to abjure violence.",
        "decision":"uphold"
    }
]